app/Controllers/Dashboard.php

    public function index()
    {
        $data = [
            'title' => 'Dashboard'
        ];

        $role = session()->get('role_name');
        $userId = session()->get('user_id');

        switch ($role) {
            case 'admin':
                $data['total_users'] = count($this->userModel->findAll());
                $data['total_events'] = count($this->eventModel->findAll());
                $data['total_tickets'] = count($this->ticketModel->findAll());
                return view('dashboard/admin', $data);

            case 'event_organizer':
                $data['my_events'] = $this->eventModel->getEventsByOrganizer($userId);
                $eventIds = array_column($data['my_events'], 'event_id');
                $data['total_tickets_sold'] = 0;

                if (!empty($eventIds)) {
                    $tickets = $this->ticketModel->whereIn('event_id', $eventIds)->findAll();
---
SELECT *
FROM `users`
SELECT *
FROM `events`
SELECT *
FROM `tickets`
SELECT *
FROM `tickets`
WHERE `event_id` IN ('11','1','4','7','10')