app/Controllers/Events.php

    public function update($id = null)
    {
        // Check if user has permission
        if (!in_array(session()->get('role_name'), ['admin', 'event_organizer'])) {
            return redirect()->to('dashboard')->with('error', 'Akses ditolak. Anda tidak memiliki izin untuk mengakses halaman ini.');
        }

        $event = $this->eventModel->find($id);
---
SELECT *
FROM `events`
WHERE `events`.`event_id` = '12'

        ];

        // Update event
        if ($this->eventModel->update($id, $data)) {
---
UPDATE `events` SET `event_name` = 'Gelora Musik - Volume 1', `description` = 'Gelora Musik dengan artis terkenal', `event_date` = '2025-07-23', `event_time` = '16:20:00', `venue` = 'Magelang', `total_tickets` = '5000', `price` = '125000.00'
WHERE `events`.`event_id` IN ('12')

    public function delete($id = null)
    {
        // Check if user has permission
        if (!in_array(session()->get('role_name'), ['admin', 'event_organizer'])) {
            return redirect()->to('dashboard')->with('error', 'Akses ditolak. Anda tidak memiliki izin untuk mengakses halaman ini.');
        }

        $event = $this->eventModel->find($id);
        if (!$event) {
            return redirect()->to('events')->with('error', 'Event tidak ditemukan.');
        }

        // Check if user is the organizer or admin
        if (session()->get('role_name') !== 'admin' && $event['created_by'] != session()->get('user_id')) {
            return redirect()->to('events')->with('error', 'Anda hanya dapat menghapus event yang Anda buat.');
        }

        // Check if event has sold tickets
        $soldTickets = $this->ticketModel->where('event_id', $id)->countAllResults();
        if ($soldTickets > 0) {
            return redirect()->to('events')->with('error', 'Event tidak dapat dihapus karena sudah ada tiket yang terjual.');
        }



        // Delete event
        if ($this->eventModel->delete($id)) {
---
SELECT *
FROM `events`
WHERE `events`.`event_id` = '12'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `event_id` = '12'
DELETE FROM `events`
WHERE `event_id` IN ('12')