app/Controllers/Profile.php

SELECT *
FROM `roles`
---
    public function edit()
    {
        $userId = session()->get('user_id');
        $user = $this->userModel->getUser($userId);

        if (!$user) {
            return redirect()->to('dashboard')->with('error', 'Data user tidak ditemukan.');
        }

        $data = [
            'title' => 'Edit Profile',
            'user' => $user,
            'roles' => $this->roleModel->findAll()