app/Controllers/Users.php

    public function edit($id = null)
    {
        // Check if user is admin
        if (session()->get('role_name') !== 'admin') {
            return redirect()->to('dashboard')->with('error', 'Akses ditolak. Anda tidak memiliki izin untuk mengakses halaman ini.');
        }

        $user = $this->userModel->find($id);
        if (!$user) {
            return redirect()->to('users')->with('error', 'User tidak ditemukan.');
        }

        $data = [
            'title' => 'Edit User',
            'user' => $user,
            'roles' => $this->roleModel->findAll()
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '4'
SELECT *
FROM `roles`