app/Models/EventModel.php

SELECT `e`.*, `u`.`full_name` as `organizer_name`, COUNT(t.ticket_id) as sold_tickets
FROM `events` `e`
LEFT JOIN `users` `u` ON `u`.`user_id` = `e`.`created_by`
LEFT JOIN `tickets` `t` ON `t`.`event_id` = `e`.`event_id`
GROUP BY `e`.`event_id`
ORDER BY `e`.`created_at` DESC
---
    public function getEventsWithStats()
    {
        $builder = $this->db->table('events e');
        $builder->select('e.*, u.full_name as organizer_name, COUNT(t.ticket_id) as sold_tickets');
        $builder->join('users u', 'u.user_id = e.created_by', 'left');
        $builder->join('tickets t', 't.event_id = e.event_id', 'left');
        $builder->groupBy('e.event_id');
        $builder->orderBy('e.created_at', 'DESC');

        return $builder->get()->getResultArray();

SELECT `e`.*, `u`.`full_name` as `organizer_name`, COUNT(t.ticket_id) as sold_tickets
FROM `events` `e`
LEFT JOIN `users` `u` ON `u`.`user_id` = `e`.`created_by`
LEFT JOIN `tickets` `t` ON `t`.`event_id` = `e`.`event_id`
WHERE `e`.`created_by` = '2'
GROUP BY `e`.`event_id`
ORDER BY `e`.`created_at` DESC
---
    public function getEventsWithStatsByOrganizer($userId)
    {
        $builder = $this->db->table('events e');
        $builder->select('e.*, u.full_name as organizer_name, COUNT(t.ticket_id) as sold_tickets');
        $builder->join('users u', 'u.user_id = e.created_by', 'left');
        $builder->join('tickets t', 't.event_id = e.event_id', 'left');
        $builder->where('e.created_by', $userId);
        $builder->groupBy('e.event_id');
        $builder->orderBy('e.created_at', 'DESC');

        return $builder->get()->getResultArray();

SELECT `events`.*, `users`.`full_name` as `organizer_name`
FROM `events`
JOIN `users` ON `users`.`user_id` = `events`.`created_by`
WHERE `events`.`created_by` = '2'
ORDER BY `events`.`event_date` ASC
---
    public function getEventsByOrganizer($userId)
    {
        return $this->select('events.*, users.full_name as organizer_name')
                    ->join('users', 'users.user_id = events.created_by')
                    ->where('events.created_by', $userId)
                    ->orderBy('events.event_date', 'ASC')
                    ->findAll();