app/Models/TicketModel.php

    public function getSoldTicketsByOrganizer($organizerId)
    {
        return $this->select('tickets.*, events.event_name, events.event_date, events.event_time, events.venue, users.full_name as buyer_name')
                    ->join('events', 'events.event_id = tickets.event_id')
                    ->join('users', 'users.user_id = tickets.user_id')
                    ->where('events.created_by', $organizerId)
                    ->orderBy('tickets.purchase_date', 'DESC')
                    ->findAll();
---
SELECT `tickets`.*, `events`.`event_name`, `events`.`event_date`, `events`.`event_time`, `events`.`venue`, `users`.`full_name` as `buyer_name`
FROM `tickets`
JOIN `events` ON `events`.`event_id` = `tickets`.`event_id`
JOIN `users` ON `users`.`user_id` = `tickets`.`user_id`
WHERE `events`.`created_by` = '2'
ORDER BY `tickets`.`purchase_date` DESC