app/Models/UserModel.php

    public function getUser($id)
    {
        return $this->select('users.*, roles.role_name')
                    ->join('roles', 'roles.role_id = users.role_id')
                    ->find($id);
---
SELECT `users`.*, `roles`.`role_name`
FROM `users`
JOIN `roles` ON `roles`.`role_id` = `users`.`role_id`
WHERE `users`.`user_id` = '1'

    public function getUserByUsername($username)
    {
        return $this->select('users.*, roles.role_name')
                    ->join('roles', 'roles.role_id = users.role_id')
                    ->where('username', $username)
                    ->first();
---
SELECT `users`.*, `roles`.`role_name`
FROM `users`
JOIN `roles` ON `roles`.`role_id` = `users`.`role_id`
WHERE `username` = 'admin'
 LIMIT 1

    public function getUsersWithRoles()
    {
        return $this->select('users.*, roles.role_name')
                    ->join('roles', 'roles.role_id = users.role_id')
                    ->orderBy('users.created_at', 'DESC')
                    ->findAll();
---
SELECT `users`.*, `roles`.`role_name`
FROM `users`
JOIN `roles` ON `roles`.`role_id` = `users`.`role_id`
ORDER BY `users`.`created_at` DESC